{
	"ru": {
		"header": {
			"main": "Главная",
			"technology": "Технологии",
			"hobby": "Хобби",
			"literature": "Литература",
			"sport": "Спорт",
			"games": "Видео Игры",
			"contacts": "Контакты",
			"mainTitle": "Моё Портфолио",
			"technologyTitle": "Стейк Технологий",
			"hobbyTitle": "Мои Интересы",
			"literatureTitle": "Любимые Книги",
			"sportTitle": "Любимые Виды Спорта",
			"gamesTitle": "Любимые Игры",
			"contactsTitle": "Контакты",
			"error": "Ошибка"
		},
		"contacts": {
			"name": "Струбицкий Андрей Александрович",
			"phoneLabel": "Номер мобильного:",
			"emailLabel": "Адрес электронной почты:",
			"githubLabel": "Профиль в github:",
			"skypeLabel": "Skype:",
			"codewarsLabel": "Профиль в codewars:"
		},
		"errors": {
			"notFound": "Страница не найдена"
		},
		"footer" : {
			"1": "2018 ©. Все права защищены.",
			"2": "Этот сайт предназначен для свободного просмотра работодателей. Любые попытки копирования сайта для своих корыстных целей будут признаны безнравственными и неуважительными по отношению к автору.",
			"3": "Если после просмота данного сайта у вас остались какие-либо вопросы, вы можете связаться со мной по телефону, указанному в разделе \"Контакты\", либо написать письмо по электронной почте. Готов рассмотреть любые предложения."
		},
		"games": {
			"intro": "Эпоха расцвета видеоигр оставила глубокий след в моей памяти. Как и многие миллионы людей, я огромное колличество часов провел за этим увлекательным занятием. Сейчас я уже отошел от этого развлечения, и не слежу за последними новинками игровой индустрии, поэтому мои любимые игры многим покажутся старыми и дывно уже вышедшими из моды.",
			"h3": "Heroes 3",
			"w3": "Warcraft 3",
			"d2": "Diablo 2"
		},
		"hobby": {
			"intro": "У каждого человека есть свои интересы и увлечения. Обычно их очень много, но не на все из них у нас хватает времени. Здесь я представил некоторые из тех занятий, которым я отдаюсь в свободное время, либо те, воспоминания о которых оставляют наиболее сильный положительный отклик в моем сердце."
		},
		"literature": {
			"intro": "В литературе отдаю предпочтение жанру фетнтези, приключениям и историческим романам. В свое время сам пробовал браться за перо, но мои книги так нигде и не были опубликованы. Сам писал в жанре фентези, также сочиняю стихи и в целом много времени уделяю чтению.",
			"author1": "Сергей Лукьяненко",
			"author2": "Александр Дюма",
			"author3": "Роберт Стивенсон"
		},
		"sport": {
			"intro": "Люблю активные виды спорта. В командных играх предпочитаю позицию защитника. Кроме того неплохо играю в шахматы, люблю боулинг, бильярд и езду на велосипеде.",
			"sport1": "Баскетбол",
			"sport2": "Work Out",
			"sport3": "Пинг-понг"
		},
		"technology": {
			"js": {
				"name": "Java Script",
				"experience": "Проходил курсы по JS, активно использовал и совершенствовал знания на протяжении всей деятельности в сфере IT.",
				"description": "JavaScript изначально создавался для того, чтобы сделать web-странички «живыми». Программы на этом языке называются скриптами. В браузере они подключаются напрямую к HTML и, как только загружается страничка – тут же выполняются. Программы на JavaScript – обычный текст. Они не требуют какой-то специальной подготовки. В этом плане JavaScript сильно отличается от другого языка, который называется Java.",
				"time": "3 года"
			},
			"react": {
				"name": "React JS",
				"experience": "Поддерживал сайт, написанный на React JS, работая на компанию Software Business Technology. Разрабатывал собственные проекты. Кстати, данный сайт тоже написан с использованием этой технологии.",
				"description": "React (иногда React.js или ReactJS) — JavaScript-библиотека с открытым исходным кодом для разработки пользовательских интерфейсов. React разрабатывается, и поддерживается Facebook, Instagram, и сообществом отдельных разработчиков, и корпораций. React может использоваться для разработки одностраничных и мобильных приложений. Его цель — предоставить высокую скорость, простоту, и масштабируемость. В качестве библиотеки для разработки пользовательских интерфейсов, React часто используется с другими библиотеками, такими как Redux.",
				"time":  "2 года"
			},
			"redux": {
				"name": "Redux",
				"experience": "При разработке сложных проектов на React JS также использую Redux для улучшения качества кода.",
				"description": "Redux — это инструмент управления как состоянием данных, так и состоянием интерфейса в JavaScript-приложениях. Он подходит для одностраничных приложений, в которых управление состоянием может со временем становиться сложным. Redux не связан с каким-то определенным фреймворком, и хотя разрабатывался для React, может использоваться с Angular или jQuery.",
				"time":  "2 года"
			},
			"node": {
				"name": "Node JS",
				"experience": "В профессиональной деятельности знания Node JS мне не требовалось, поэтому данная технология не изучена на достаточном для активной разработке уровне. Тем не менее при написании собственных проектов мне постоянно приходилось писать серверы для обеспечения работы сайтов с использованием технологии React JS на локальном компьютере.",
				"description": "Node или Node.js — программная платформа, основанная на движке V8 (транслирующем JavaScript в машинный код), превращающая JavaScript из узкоспециализированного языка в язык общего назначения. Node.js добавляет возможность JavaScript взаимодействовать с устройствами ввода-вывода через свой API (написанный на C++), подключать другие внешние библиотеки, написанные на разных языках, обеспечивая вызовы к ним из JavaScript-кода. Node.js применяется преимущественно на сервере, выполняя роль веб-сервера, но есть возможность разрабатывать на Node.js и десктопные оконные приложения (при помощи NW.js, AppJS или Electron для Linux, Windows и macOS) и даже программировать микроконтроллеры (например, tessel и espruino). В основе Node.js лежит событийно-ориентированное и асинхронное (или реактивное) программирование с неблокирующим вводом/выводом.",
				"time":  "2 года"
			},
			"php": {
				"name": "PHP",
				"experience": "В ходе работы мне постоянно приходится сталкиваться с PHP, поскольку я в основном занимаюсь либо разработкой сайтов на распространенных СMS, либо поддержкой проектов написанных на фрейворках этого языка.",
				"description": "PHP (/pi:.eɪtʃ.pi:/ англ. PHP: Hypertext Preprocessor — «PHP: препроцессор гипертекста»; первоначально Personal Home Page — «Инструменты для создания персональных веб-страниц») — скриптовый язык общего назначения, интенсивно применяемый для разработки веб-приложений. В настоящее время поддерживается подавляющим большинством хостинг-провайдеров и является одним из лидеров среди языков, применяющихся для создания динамических веб-сайтов. В компьютерном сленге часто именуется \"Пыня\". Язык и его интерпретатор (Zend Engine) разрабатываются группой энтузиастов в рамках проекта с открытым кодом. Проект распространяется под собственной лицензией, несовместимой с GNU GPL.",
				"time":  "3 года"
			},
			"laravel": {
				"name": "Laravel",
				"experience": "Работая на Business Solution LTD я поддерживал CRM, написанную на фреймворке Laravel. Своих проектов на этом языке не разрабатывал",
				"description": "Laravel — бесплатный веб-фреймворк с открытым кодом, предназначенный для разработки с использованием архитектурной модели MVC (англ. Model View Controller — модель-представление-контроллер). Laravel выпущен под лицензией MIT. Исходный код проекта размещается на GitHubВ результате опроса sitepoint.com в декабре 2013 года о самых популярных PHP-фреймворках Laravel занял место самого многообещающего проекта на 2014 годВ 2015 году в результате опроса sitepoint.com по использованию PHP-фреймворков среди программистов занял первое место в номинациях1. Фреймворк корпоративного уровня2. Фреймворк для личных проектов3. Кладезь антипаттернов.",
				"time":  "1 год"
			},
			"wordpress": {
				"name": "Word Press",
				"experience": "При работе в компании Webmatrix и Business Solution LTD создавал много сайтов на Word Press.",
				"description": "WordPress — система управления содержимым сайта с открытым исходным кодом; написана на PHP; сервер базы данных — MySQL; выпущена под лицензией GNU GPL версии 2. Сфера применения — от блогов до достаточно сложных новостных ресурсов и интернет-магазинов. Встроенная система «тем» и «плагинов» вместе с удачной архитектурой позволяет конструировать проекты широкой функциональной сложности.",
				"time":  "3 года"
			},
			"opencart": {
				"name": "Opencart",
				"experience": "На вебстудии Webmatrix создал много интерет магазинов на CMS Opencart.",
				"description": "OpenCart — e-commerce platform, ориентированная на создание интернет-магазинов. Является свободным программным обеспечением, распространяемым по лицензии GNU General Public License v3. Системой «OpenCart» поддерживаются дополнения«OpenCart» создан и поддерживается Дениэлем Керром в репозитории GitHub. Программное обеспечение написано на языке программирования PHP, а в архитектуре использован шаблон проектирования MVCL.",
				"time":  "1 год"
			},
			"experience": "Опыт работы:",
			"description": "Описание технологии:",
			"time": "Время работы с этой технологией:"
		},
		"main": {
			"topText": "Компании, в которых я работал:",
			"workPeriodLabel": "Период работы: ",
			"aetDescription": "Работа в \"AET Groupe\" была началом моей карьеры в сфере IT. На тот момент у меня не было ни навыков, ни опыта, да, откровенно говоря, и знаний не хватало. В основном я выполнял самую простую работу. По большей части, это верстка, не обремененная сложными технологиями. Мною выполнялись обязанности контент менеджера, верстальщика HTML рассылок.\n Шло время, и вместе с ним повышались мои навыки. С помощью JS я научился создавать слайдеры, устанавливать фильтры, менять контент страниц. Венцом моей профессиональной деятельности в этой кампании был созданный и поставленный на систему MODX сайт для 5D кинотеатров. После этого зарплата, которую мне платили в данной кампании перестала меня устраивать.",
			"aetPeriod": "Декабрь 2015 - Июнь 2016",
			"learn": "Научился работать:",
			"layout": "Верстка HTML-писем",
			"webmatrixDescription": "Работа в вебстудии \"Webmatrix\" требовала намного больших знаний, нежели в предыдущей компании. Там я научился создавать интернет магазины, отточил навыки верстки до автоматизма, познакомился с правилами XHR запросов. В основном здесь мне приходилось работать с системой opencart. Так же здесь я научился активно использовать и редактировать плагины, менять шаблоны и переносить товары из одной базы данных MYSQL в другую.\n Но чем больше я там работал, тем отчетлевее понимал, что конвеер по созданию сайтов - это не то, к чему я стремился, делая первые шаги по изучению языков программирования. Я мечтал создавать сложные проекты, использовать передовые технологии, работать в команде проффессиональных разработчиков. Здесь же мне не давали выйти за пределы стандартных CMS на базе PHP. Осознание бесперспективности в плане личностного роста дали мотивацию к дальнейшему поиску более подходящей работы.",
			"webmatrixPeriod": "Август 2016 - Июнь 2017",
			"ltd": "В компании \"Business Solution LTD\" основной моей задачей было поддержание CRM, написанной на фреймворке \"Laravel\". До этого я не только не знал Laravel, но и в принципе плохо представлял себе, что такое фреймворк, и как на нем можно создавать сайты и программы. Здесь я понял, что такое router, и как работает прокси сервер. Кроме того здесь я изучил Word Press, так как основной сайт был написан именно на этой CMS. За несколько месяцев я изучил принцип работы CRM, научился автоматически интегрировать пользователей, заполнивших форму регистрации, в систему. Эта работа была и перспективной и полезной в плане профессионального роста, но она имела огромный минус: во всех проектах использовался язык PHP. Сердце мое лежало к языку Java Script. Уже тогда, когда у меня появлялась свободная минутка, я изучал React JS, и это мне очень пригодилось на следующей работе.",
			"ltdPeriod": "Июнь 2017 - Ноябрь 2017",
			"software": "Когда я устроился в \"Software Business Technology\", я уже многое знал и умел. Но до этого я всегда был единственным разработчиком в доверенной мне области. Здесь же я научился работать в команде, освоил систему управления версиями GIT. И несмотря на то, что изначально меня брали как Word Press разработчика, я очень быстро сделал все задачи по редактированию сайтов и принял участие в разработке проекта по React JS",
			"softwarePeriod": "Ноябрь 2017 по настоящее время"
		}
	},
	"en": {
		"header": {
			"main": "Main",
			"technology": "Technology",
			"hobby": "Hobby",
			"literature": "Literature",
			"sport": "Sport",
			"games": "Video games",
			"contacts": "Contacts",
			"mainTitle": "My Portfolio",
			"technologyTitle": "Technology Steak",
			"hobbyTitle": "My interests",
			"literatureTitle": "Favorite books",
			"sportTitle": "Favorite Sports",
			"gamesTitle": "Favorite Games",
			"contactsTitle": "Contacts",
			"error": "Error"
		},
		"contacts": {
			"name": "Strubitskiy Andrey",
			"phoneLabel": "Phone number:",
			"emailLabel": "Email:",
			"githubLabel": "Profile in github:",
			"skypeLabel": "Skype:",
			"codewarsLabel": "Profile in codewars:"
		},
		"errors": {
			"notFound": "Page not found"
		},
		"footer" : {
			"1": "2018 ©. All rights reserved.",
			"2": "This site is designed for free viewing of employers. Any attempt to copy the site for their own selfish purposes will be considered immoral and disrespectful to the author.",
			"3": "If after seeing this site you have any questions, you can contact me by phone, indicated in the \"Contacts\" section, or write a letter by e-mail. I am ready to consider any proposals."
		},
		"games": {
			"intro": "The era of the heyday of video games has left a deep imprint in my memory. Like many millions of people, I spent a lot of hours on this fascinating activity. Now I have already moved away from this entertainment, and I do not follow the latest innovations in the gaming industry, so my favorite games will seem to many old and already gone out of fashion.",
			"h3": "Heroes 3",
			"w3": "Warcraft 3",
			"d2": "Diablo 2"
		},
		"hobby": {
			"intro": "Each person has his own interests and hobbies. Usually there are a lot of them, but not all of them we have enough time. Here I presented some of those activities that I give in my spare time, or those whose memories leave the strongest positive response in my heart."
		},
		"literature": {
			"intro": "In literature, I prefer the genre of fetntezi, adventure and historical novels. At one time he tried to take up his pen, but my books were not published anywhere. Sam wrote in the genre of fantasy, I also compose poetry and in general spend a lot of time reading.",
			"author1": "Сергей Лукьяненко",
			"author2": "Александр Дюма",
			"author3": "Роберт Стивенсон"
		},
		"sport": {
			"intro": "I love active sports. In team games I prefer the position of the defender. In addition, I play chess well, like bowling, billiards and cycling.",
			"sport1": "Basketball",
			"sport2": "Work Out",
			"sport3": "Ping-pong"
		},
		"technology": {
			"js": {
				"name": "Java Script",
				"experience": "I took courses in JS, actively used and improved my knowledge during all activity in the field of IT.",
				"description": "JavaScript was originally created in order to make web-pages \"alive\". Programs in this language are called scripts. In the browser, they connect directly to HTML and, as soon as the page is loaded - immediately executed. JavaScript programs are plain text. They do not require any special training. In this respect, JavaScript is very different from another language, called Java.",
				"time": "3 years"
			},
			"react": {
				"name": "React JS",
				"experience": "Supported a site written on React JS, working for the company Software Business Technology. I developed my own projects. By the way, this site is also written using this technology.",
				"description": "React (sometimes React.js or ReactJS) is an open source JavaScript library for developing user interfaces. React is developed, and supported by Facebook, Instagram, and the community of individual developers, and corporations. React can be used to develop single-page and mobile applications. Its goal is to provide high speed, simplicity, and scalability. As a library for developing user interfaces, React is often used with other libraries, such as Redux.",
				"time":  "2 years"
			},
			"redux": {
				"name": "Redux",
				"experience": "When developing complex projects on React JS I also use Redux to improve the quality of the code.",
				"description": "Redux is a tool for managing both the data state and the state of the interface in JavaScript applications. It is suitable for single-page applications in which state management can become complex over time. Redux is not associated with any particular framework, and although designed for React, can be used with Angular or jQuery.",
				"time":  "2 years"
			},
			"node": {
				"name": "Node JS",
				"experience": "In the professional work of the knowledge of Node JS, I was not required, so this technology has not been studied at a level sufficient for active development. Nevertheless, when writing my own projects, I constantly had to write servers to support the operation of sites using React JS technology on the local computer.",
				"description": "Node or Node.js is a software platform based on the V8 engine (translating JavaScript into machine code), which turns JavaScript from a highly specialized language into a general-purpose language. Node.js adds the ability of JavaScript to interact with I / O devices through its API (written in C ++), connect other external libraries written in different languages, providing calls to them from JavaScript code. Node.js is used primarily on the server, acting as a web server, but it is possible to develop on Node.js and desktop window applications (using NW.js, AppJS or Electron for Linux, Windows and macOS) and even program microcontrollers (for example, tessel and espruino). Node.js is based on event-oriented and asynchronous (or reactive) programming with non-blocking I / O.",
				"time":  "2 years"
			},
			"php": {
				"name": "PHP",
				"experience": "In the course of the work, I constantly have to deal with PHP, because I mainly deal with the development of sites on common CMS, or with the support of projects written in the framework of this language.",
				"description": "PHP (/pi:.eɪtʃ.pi:/ English: PHP: Hypertext Preprocessor, originally Personal Home Page - \"Tools for creating personal web pages\") is a general-purpose scripting language that is heavily used for development web applications. Currently supported by the vast majority of hosting providers and is one of the leaders among the languages ​​used to create dynamic Web sites. In computer slang is often referred to as \"Melody\". The language and its interpreter (Zend Engine) are developed by a group of enthusiasts within the framework of an open source project. The project is distributed under its own license, which is incompatible with the GNU GPL.",
				"time":  "3 years"
			},
			"laravel": {
				"name": "Laravel",
				"experience": "Working on Business Solution LTD, I supported CRM, written in the Laravel framework. His projects in this language did not develop",
				"description": "Laravel is a free open source web framework designed for development using the Model Model Controller MVC (English Model View Controller). Laravel is released under the MIT license. The source code of the project is hosted on GitHub. As a result of a sitepoint.com poll in December 2013 about the most popular PHP frameworks, Laravel took the place of the most promising project for 2014. In 2015, as a result of a survey sitepoint.com on the use of PHP-frameworks among programmers took first place in the categories: 1. An enterprise-class framework. 2. A framework for personal projects. 3. A well of antipatterns.",
				"time":  "1 year"
			},
			"wordpress": {
				"name": "Word Press",
				"experience": "When working for the company Webmatrix and Business Solution LTD created many sites on Word Press.",
				"description": "WordPress - a system for managing the content of an open source site; written in PHP; database server - MySQL; released under the GNU GPL license version 2. The scope - from blogs to fairly complex news resources and online stores. The built-in system of \"themes\" and \"plugins\" together with a successful architecture allows you to design projects of broad functional complexity.",
				"time":  "3 yearы"
			},
			"opencart": {
				"name": "Opencart",
				"experience": "On web studio Webmatrix created many online stores on CMS Opencart.",
				"description": "OpenCart - e-commerce platform, focused on creating online stores. Is free software distributed under the license of GNU General Public License v3. The \"OpenCart\" system supports additions \"OpenCart\" created and supported by Daniel Kerr in the GitHub repository. The software is written in the PHP programming language, and the MVCL design pattern is used in the architecture.",
				"time":  "1 year"
			},
			"experience": "Experience:",
			"description": "Description of the technology:",
			"time": "Time to work with this technology:"
		},
		"main": {
			"topText": "The companies in which I worked:",
			"workPeriodLabel": "Work period: ",
			"aetDescription": "The work in \"AET Groupe\" was the beginning of my career in IT. At that time, I did not have the skills or experience, and, frankly, I did not have enough knowledge. Basically, I did the simplest job. For the most part, this is a layout that is not burdened with complex technologies. I was responsible for the content manager, HTML layout maker. \n Time passed, and with it my skills improved. With the help of JS, I learned how to create sliders, install filters, and change the content of pages. The crown of my professional activity in this campaign was the site created and put on the MODX system for 5D cinemas. After that, the salary that I was paid in this campaign ceased to suit me.",
			"aetPeriod": "December 2015 - June 2016",
			"learn": "Has learned to work:",
			"layout": "Make HTML-letters",
			"webmatrixDescription": "Work in web studio \"Webmatrix\" required much more knowledge than in the previous company. There I learned how to create online stores, perfected the layout skills to automatism, got acquainted with the rules of XHR queries. Basically here I had to work with the opencart system. Also here I learned how to actively use and edit plug-ins, change templates and transfer products from one MYSQL database to another.\n But the more I worked there, the more I realized that the pipeline for creating websites is not what I sought, taking the first steps in the study of programming languages. I dreamed of creating complex projects, using advanced technologies, working with a team of professional developers. Here, I was not allowed to go beyond the standard CMS based on PHP. The realization of hopelessness in terms of personal growth gave motivation for the further search for a more suitable job.",
			"webmatrixPeriod": "August 2016 - June 2017",
			"ltd": "In the company \"Business Solution LTD\" my main task was to maintain CRM, written in the framework \"Laravel\". Before that, I not only did not know Laravel, but in principle I had a bad idea of ​​what a framework was, and how you can create websites and programs on it. Here I understood what a router is, and how the proxy server works. In addition, here I studied Word Press, since the main site was written exactly on this CMS. For a few months I studied the principle of CRM work, I learned how to automatically integrate users who filled out the registration form into the system. This work was both perspective and useful in terms of professional growth, but it had a huge disadvantage: all projects used the language of PHP. My heart lay to the language of Java Script. Already when I had a free minute, I studied React JS, and it was very useful to me at the next job.",
			"ltdPeriod": "June 2017 - November 2017",
			"software": "When I got a job at \"Software Business Technology\", I already knew and knew a lot. But before that, I was always the only developer in the field entrusted to me. Here I learned to work in a team, I mastered the version control system GIT. And despite the fact that initially I was taken as a Word Press developer, I very quickly made all the tasks of editing sites and took part in the development of the project on React JS",
			"softwarePeriod": "November 2017 to the present"
		}
	}
}